--- a/README.md
+++ b/README.md
@@ -9,44 +9,36 @@ The information presented on the page is taken from three different data sources
 
 ## Diagram
 
-```plantuml
-skinparam sequenceMessageAlign center
-participant "FAA Notam Search API" as NotamSearch
-participant "MET.no API" as MetNorway
-participant "Flygplanering.se" as Backend #green
-participant Client
+```mermaid
+sequenceDiagram
+    participant NotamSearch as FAA Notam Search API
+    participant MetNorway as MET.no API
+    participant Backend as Flygplanering.se
+    participant Client as Client
 
-NotamSearch <- Backend : POST /search
-NotamSearch -> Backend : NOTAM data
+    Backend ->> NotamSearch : POST /search
+    NotamSearch ->> Backend : NOTAM data
 
-.......
+    Backend ->> MetNorway : GET /tafmetar/1.0/metar
+    MetNorway ->> Backend : METAR data
 
-MetNorway <- Backend : GET /tafmetar/1.0/metar
-MetNorway -> Backend : METAR data
+    Backend ->> MetNorway : GET /tarmetar/1.0/taf
+    MetNorway ->> Backend: TAF data
 
-MetNorway <- Backend : GET /tafmetar/1.0/taf
-MetNorway -> Backend : TAF data
+    note right of Backend: Process and store data in memory
 
-......
-
-rnote over Backend 
-  Process and store
-  data in memory
-endrnote
-
-Backend <- Client : GET /index.html
-Backend -> Client : Page data
-
+    Client ->> Backend : GET /index.html
+    Backend ->> Client : Page data
 ```
 
 ## License
